/********************************************************************************
*  描述:                                                                        *
*         数码管显示 遥控键值读取器                                             *
*          遥控器接p3.2                                                         *
*  现象：当按遥控器时，按下事 数码管会有闪烁，为什么会闪烁呢                    *
*                                                                               *
*         连接方法：使用红外功能时 J1跳线短接                                   *
*****************************************************************************8**/
#ifndef _IR_H_
#define _IR_H_

#define IR_IO_IN        GPIO_Pin_8  /*p3^2   PA8*/
#define IR_NUM_CNT      4 /* 每次有4个数值 */
#define IR_1_TICK_CNT   225 /*2.25 ms*/
#define IR_0_TICK_CNT   112 /*1.12 ms*/


extern void EXTI8_IR_handler(void);
#endif /*#ifndef _IR_H_*/
